<%@ page pageEncoding="UTF-8"%>
<%@ page contentType="text/html; charset=UTF-8"%>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core"%>
<link rel="stylesheet" href="${ctxPath}/css/header.css" type="text/css">
<article>
	<section class="article-content clearfix">
		<p>
			<span style="font-size: 12pt; line-height: 175%;"><strong>（一）中国商品分类的历史沿革</strong></span>
		</p>
		<p class="Custom_UnionStyle" align="justify">
			<br> <span style="font-size: 12pt; line-height: 175%;">&nbsp;&nbsp;&nbsp;&nbsp;众
				所周知，商标是区别商品或服务来源的一
				种标志，每一个注册商标都是指定用于某一商品或服务上的。如提到长虹，人们会想到彩色电视机；提到茅台，人们会想到酒；提到美加净，人们会想到化妆品等
				等。应该说，离开商品或服务而独立存在的商标是不存在的。所以在办理商标注册申请时，正确表述所要指定的商品或服务及其所属类别，是商标申请人（代理人）
				首先会遇到的问题。<br style="font-size: 12pt; line-height: 175%;">
				&nbsp;&nbsp;&nbsp;&nbsp;许多不同的部门出于管理、统计等工作需要都要对商品进行分类。如从国民经济管理的角度，通常将商品分为工业品和农产品两大类，工业品中又分重工产
				品和轻工产品，重工业产品中又可划分为冶金工业产品、机械工业产品等等。国家商标主管机关为了商标注册和管理的需要，也需要对商品进行分类。商标注册和管
				理，应该说是一项庞大、复杂的系统工程，商品及服务分类是商标局的一项基础工作。我国目前已有注册商标七百多万件，如果没有一套科学的分类管理体系，要想
				检索、查询、调阅一个商标，就像大海捞针一样，几乎是不可能的。<br
				style="font-size: 12pt; line-height: 175%;">
				&nbsp;&nbsp;&nbsp;&nbsp;正是为了商标检索、审查、管理工作的需要，把某些具有共同属性的商品组合到一起，编为一个类，将所有商品及服务共划分为45个类别，形成了我们这
				里所要叙述的“商标注册用商品和服务分类”。如将“工业用油及油脂、润滑剂，吸收、喷洒和粘结灰尘用品，燃料（包括马达用的汽油）和照明剂，蜡烛，灯芯”
				等组合在一起，形成一个类（第4类）；又如，将“外科、医疗、牙科和兽医用仪器及器械，假肢、假眼和假牙、矫形用品、缝合材料”等组合在一起，形成另一个
				类（第10类）。商标局的查询检索系统是按照商品及服务的类别设立的；《商标公告》按照类别编排；申请人申请商标注册也要按照类别提出；商标局发给注册人
				的商标注册证上也必须注明商品或服务及其所属类别。<br
				style="font-size: 12pt; line-height: 175%;">
				&nbsp;&nbsp;&nbsp;&nbsp;商品分类又是作为申请商标注册办理手续及缴纳费用的基本单位。即一个商标在一个类别上申请注册办理一份手续，缴纳一份基本费用。如一个申请人在医
				用化学药品、中成药、中药材、药酒、医用营养物品、空气净化制剂、兽药、农药、卫生巾、牙填料上申请注册商标，虽然其指定的商品多达十项，但因这些商品均
				属同一类别（5类），所以只需办理一份手续，缴纳一份基本费用（即一标一类）。而另一企业申请注册的商标虽然仅需使用在绘画笔和绘画颜料上，但需填写两份
				申请书，在两个类别分别申请，并缴纳两份基本费用，因为这两种商品分别属于两个类别，即绘画笔属于第16类，绘画颜料属于第2类。<br
				style="font-size: 12pt; line-height: 175%;">
				&nbsp;&nbsp;&nbsp;&nbsp;以往，都是由各国的商标主管机关根据本国的国情及对商品的理解，制定各自的商品分类表，供商标主管机关及商标注册申请人使用。商品分类表不是一成
				不变的。它会随着商品的丰富及人们对商品的认识而逐步增加及修订。我国自1923年起，先后制定公布过五个商品分类表。到二十世纪五十年代，世界经济得到
				了较大的发展，国际间的交往更加频繁。一些国家认为，各国使用各自的商品分类表已不能适应有关商标事务的国际联系，给商标所有人到国外注册带来了麻烦，不
				利于商标事业的发展和经济发展。这些国家的商标主管机关认为，需要有一个国际统一的商标注册用商品分类表。在这种情况下产生了尼斯协定。
			</span>
		</p>
		<p class="Custom_UnionStyle" style="text-align: left;" align="center">
			<br> <span style="font-size: 12pt; line-height: 175%;"><strong>（二）商标注册用商品和服务国际分类的发展与现状</strong>
			</span>
		</p>
		<p class="Custom_UnionStyle" align="left">
			<br> <span style="font-size: 12pt; line-height: 175%;">&nbsp;&nbsp;&nbsp;
				尼斯协定是一个有多国参加的国际公约，其全称是《商标注册用商品和服务国际分类尼斯协定》。该协定于1957年6月15日在法国南部城市尼斯签
				订，1961年4月8日生效。尼斯协定的成员国目前已发展到65个。我国于1994年8月9日加入了尼斯联盟。尼斯协定的宗旨是建立一个共同的商标注册用
				商品和服务国际分类体系，并保证其实施。目前，国际分类共包括45类，其中商品34类，服务项目11类，共包含一万多个商品和服务项目。申请人所需填报的
				商品及服务一般说来都在其中了。不仅所有尼斯联盟成员国都使用此分类表，而且，非尼斯联盟成员国也可以使用该分类表。所不同的是，尼斯联盟成员可以参与分
				类表的修订，而非成员国则无权参与。目前世界上已有一百三十多个国家和地区采用此分类表。我国自1988年11月1日起采用国际分类，大大方便了商标申请
				人，更加规范了商标主管机关的管理，密切了国际间商标事务的联系。尤其是1994年我国加入尼斯协定以来，我们积极参与了对尼斯分类的修改与完善，已将多
				项有中国特色的商品加入尼斯分类中。尼斯分类表定期修订，一是增加新的商品，二是将已列入分类表的商品按照新的观点进行调整，以求商品更具有内在的统一
				性。尼斯分类第十版自2012年1月1日起实行。<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				尼斯分类表包括两部分，一部分是按照类别排列的商品和服务分类表，一部分是按照字母顺序排列的商品和服务分类表。<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				按照类别排列的分类表将商品和服务按照1-45类的顺序排列。每类有一个类别号和标题，每类的标题概括了本类所包含商品的特征及范围，最后列出了本类包括
				的所有商品或服务项目，每项商品或服务均有一个顺序号，以便查找。另外，每一类有一个注释，对本类主要包括哪些商品，本类与相关类别的商品如何区别，如何
				划分边缘商品的类别作了说明，这个注释对划分一些易混淆商品的类别有很大帮助。如第三类，类名为“洗衣用漂白剂及其他物料，清洁、擦亮、去渍及研磨用制
				剂，肥皂，香料，香精油、化妆品，香水、牙膏、牙粉。”【注释】为：“本类主要包括洗澡用品和化妆品。尤其包括：个人用除臭剂；化妆用卫生用品。尤其不包
				括：清洁烟囱用化学制品（第一类）；生产过程中用的去渍用品（第一类）；非个人用除臭剂（第五类）；磨石或手磨砂轮（第八类）。 <br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				另一部分是按字母顺序排列的商品和服务分类表。世界知识产权组织出版了按英文、法文顺序排列的商品和服务分类表。我国商标主管机关也编排印制了按汉语拼音
				顺序排列的商品和服务分类表。使用这个表查阅一般商品的类别就像查字典一样方便。如某一生产电视机和录相机的企业，要在这两种商品上申请商标注册，按照汉
				语拼音顺序，很容易就能查到这两种商品都属于第9类；又如，某一生产食品的企业要在牛奶和冰淇淋上申请商标注册，借助该表，也可以很快查到这两种商品分别
				属于第29类（牛奶）和第30类（冰淇淋）。
			</span>
		</p>
		<p class="Custom_UnionStyle" style="text-align: left;" align="center">
			<span style="font-size: 12pt; line-height: 175%;">&nbsp;<br
				style="font-size: 12pt; line-height: 175%;"> <strong>（三）商品及服务分类遵循的原则</strong>&nbsp;&nbsp;
			</span>
		</p>
		<p class="Custom_UnionStyle" align="left">
			<span style="font-size: 12pt; line-height: 175%;">&nbsp;&nbsp;
				<br style="font-size: 12pt; line-height: 175%;">
				&nbsp;&nbsp;&nbsp;
				&nbsp;世界知识产权组织对商品及服务进行分类时，一般遵照下列原则，各国管理机关及申请人在遇到分类表上没有的商品及服务项目，需要进行分类时，也可按照以下标准划分<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				&nbsp;1．商品<br style="font-size: 12pt; line-height: 175%;">
				&nbsp;
				&nbsp;&nbsp;（1）制成品原则上按其功能、用途进行分类，如果分类表没有规定分类的标准，该制成品即按字母排列的分类表内类似的其他制成品分在一类，也可以根据辅助的分类标准，即根据这些制成品的材料或其操作方式进行分类；<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;
				&nbsp;（2）多功能的组合制成品（如钟和无线电收音机的组合产品）可以根据产品中各组成部分的功能或用途，把该产品分在与这些功能或用途相应的不同类别里，若类别表中没有规定这些标准，则可以采用第（1）条中所示的标准；<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;
				&nbsp;（3）原料、未加工品或半成品原则上按其组成的原材料进行分类；<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				（4）商品构成其它商品某一部分，原则上与其他商品分在一类，但这种同类商品在正常情况下不能用于其它用途。其他所有情况均按上述标准（1）进行分类；<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				（5）成品或半成品按其组成的原材料分类时，如果是由几种不同原材料制成，原则上按其主要原材料进行分类；<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				（6）用于盛放商品的盒、箱之类的容器，原则上与该商品分在同一类。<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				（1）制成品原则上按其功能或用途进行分类。如果各类类别标题均未涉及某一制成品的功能或用途，该制成品就比照字母顺序分类表中其他的类似制成品分类。如果没有类似的，可以根据辅助标准进行分类，如按制成品的原材料或其操作方式进行分类。<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				（2）多功能的组合制成品（如钟和收音机的组合产品）可以分在与其各组成部分的功能或用途相应的所有类别里。如果各类类别标题均未涉及这些功能或用途，则可以采用第（1）条中所示的标准。<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				（3）原料、未加工品或半成品原则上按其组成的原材料进行分类。<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				（4）商品是构成其他产品的一部分，且该商品在正常情况下不能用于其它用途，则该商品原则上与其所构成的产品分在同一类。其他所有情况均按第（1）条中所示的标准进行分类。<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				（5）成品或非成品按其组成的原材料分类时，如果是由几种不同原材料制成，原则上按其主要原材料进行分类。<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				（6）用于盛放商品的专用容器，原则上与该商品分在同一类。<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				&nbsp;2．服务<br style="font-size: 12pt; line-height: 175%;">
				&nbsp;&nbsp;&nbsp;
				（1）服务原则上按照服务分类类名及其注释所划分的行业进行分类，也可以按字母排列的分类表中类似的服务分在一类；<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				（2）出租业的服务，原则上与通过出租物所实现的服务分在一类（如出租电话机，分在38类） ；<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				（3）提供建议、信息或咨询的服务原则上与提供服务所涉及的事务归于同一类别，例如运输咨询（第39类），商业管理咨询（第35类），金融咨询（第36类），美容咨询（第44类）。以电子方式（例如电话、计算机）提供建议、信息或咨询不影响这种服务的分类。<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				（1）服务原则上按照服务类类别标题及其注释所列出的行业进行分类，若未列出，则可以比照字母顺序分类表中其他的类似服务分类。<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				（2）出租服务，原则上与通过出租物所实现的服务分在同一类别（如出租电话机，分在第三十八类）。租赁服务与出租服务相似，应采用相同的分类原则。但融资租赁是金融服务，分在第三十六类。<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				（3）提供建议、信息或咨询的服务原则上与提供服务所涉及的事物归于同一类别，例如运输咨询（第三十九类），商业管理咨询（第三十五类），金融咨询（第三
				十六类），美容咨询（第四十四类）。以电子方式（例如电话、计算机）提供建议、信息或咨询不影响这种服务的分类。<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				（4）特许经营的服务原则上与特许人所提供的服务分在同一类别（例如，特许经营的商业建议（第三十五类），特许经营的金融服务（第三十六类），特许经营的法律服务（第四十五类）。
			</span>
		</p>
		<p class="Custom_UnionStyle" style="text-align: left;" align="center">
			<br> <span style="font-size: 12pt; line-height: 175%;"><strong>（四）商品及服务名称的填写</strong></span>
		</p>
		<p class="Custom_UnionStyle" align="left">
			<br> <span style="font-size: 12pt; line-height: 175%;">&nbsp;&nbsp;&nbsp;
				商品名称是整个商标注册工作的重要内容之一，它决定了注册商标保护的范围。因此，在申请商标注册时，必须指明具体的商品和服务名称。并且，一份申请书上填
				报的商品或服务只能限定在一个类别之内。商品名称力求具体、准确、规范，以便明确指定该商标的保护范围。在《类似商品和服务区分表》中，每个类别有注释，
				并将商品或服务项目分为不同群组，提出商标注册申请时不能填写注释部分和群组名，如2907奶及乳制品，4301提供餐饮，住宿服务。一般说来，一个商品
				在商品分类表中有正规名称时，应使用分类表中的规范名称。某些人们日常生活中约定俗成的商品称谓，在申请商标注册时是不允许使用的。如“家用电器”，因为
				它包括的范围过大，涉及商品分类表中至少五个类别的商品。例如第七类的洗衣机、家用电动碾磨机；第八类的电动刮胡刀；第九类的电视机；第十类的电动按摩
				器；第十一类的电冰箱等。诸如此类的情况还有“塑料制品”、“皮制品”等。<br
				style="font-size: 12pt; line-height: 175%;"> &nbsp;&nbsp;&nbsp;
				使用《类似商品和服务区分表》中规范的商品及服务名称，有助于加快商标的注册进程，确保申请人及时获得商标专用权。
			</span>
		</p>
	</section>




</article>