package com.gqgx.utils;

import java.io.UnsupportedEncodingException;
import java.util.Random;

/**
 * 随机生成名字
 */
public class ChineseNameUtil {
	public String getChineseName() {  
        Random random=new Random(System.currentTimeMillis());  
        /* 598 百家姓 */  
        String[] Surname= {"赵","钱","孙","李","周","吴","郑","王","冯","陈","褚","卫","蒋","沈","韩","杨","朱","秦","尤","许",  
                  "何","吕","施","张","孔","曹","严","华","金","魏","陶","姜","戚","谢","邹","喻","柏","水","窦","章","云","苏","潘","葛","奚","范","彭","郎",  
                  "鲁","韦","昌","马","苗","凤","花","方","俞","任","袁","柳","酆","鲍","史","唐","费","廉","岑","薛","雷","贺","倪","汤","滕","殷",  
                  "罗","毕","郝","邬","安","常","乐","于","时","傅","皮","卞","齐","康","伍","余","元","卜","顾","孟","平","黄","和",  
                  "穆","萧","尹","姚","邵","湛","汪","祁","毛","禹","狄","米","贝","明","臧","计","伏","成","戴","谈","宋","茅","庞","熊","纪","舒",  
                  "屈","项","祝","董","梁","杜","阮","蓝","闵","席","季","麻","强","贾","路","娄","危","江","童","颜","郭","梅","盛","林","刁","钟",  
                  "徐","邱","骆","高","夏","蔡","田","樊","胡","凌","霍","虞","万","支","柯","昝","管","卢","莫","经","房","裘","缪","干","解","应",  
                  "宗","丁","宣","贲","邓","郁","单","杭","洪","包","诸","左","石","崔","吉","钮","龚","程","嵇","邢","滑","裴","陆","荣","翁","荀",  
                  "羊","于","惠","甄","曲","家","封","芮","羿","储","靳","汲","邴","糜","松","井","段","富","巫","乌","焦","巴","弓","牧","隗","山",  
                  "谷","车","侯","宓","蓬","全","郗","班","仰","秋","仲","伊","宫","宁","仇","栾","暴","甘","钭","厉","戎","祖","武","符","刘","景",  
                  "詹","束","龙","叶","幸","司","韶","郜","黎","蓟","溥","印","宿","白","怀","蒲","邰","从","鄂","索","咸","籍","赖","卓","蔺","屠",  
                  "蒙","池","乔","阴","郁","胥","能","苍","双","闻","莘","党","翟","谭","贡","劳","逄","姬","申","扶","堵","冉","宰","郦","雍","却",  
                  "桑","桂","濮","牛","燕","冀","温","别","庄","晏","柴","瞿","阎","充","慕","连","茹","习",  
                  "宦","艾","容","向","古","易","慎","戈","廖","庾","终","暨","居","衡","步","都","耿","满","弘","匡","国","文","寇","广","禄",  
                  "东","欧","蔚","越","夔","隆","师","巩","聂","晁","敖","融","冷","辛","那","简","饶","空",  
                  "曾","毋","沙","乜","养","须","丰","巢","关","相","查","后","荆","红","游","郏","竺","权","盖","益","桓","公",  
                  "督","岳","帅","缑","亢","有","琴","归","海","晋","楚","闫","商","伯","赏","墨",  
                  "年","爱","阳","佟","铁","迟","官","冼","展","舜","楼", "高","皋","原","种","弥","仓","蹇","覃","来","麦"};  
          
        String[] SexName={"先生","女士"};
        int index=random.nextInt(Surname.length-1);  
        int ind=random.nextInt(SexName.length);
        String name = Surname[index]+SexName[ind]; //获得一个随机的姓氏  
          
        /* 从常用字中选取一个或两个字作为名 */  
        /*if(random.nextBoolean()){  
            name+=getChinese()+getChinese();  
        }else {  
            name+=getChinese();  
        } */
        return name;
    }  
      
    public String getChinese() {  
        String str = null;  
        int highPos, lowPos;  
        Random random = new Random();  
        highPos = (176 + Math.abs(random.nextInt(71)));//区码，0xA0打头，从第16区开始，即0xB0=11*16=176,16~55一级汉字，56~87二级汉字  
        random=new Random();  
        lowPos = 161 + Math.abs(random.nextInt(94));//位码，0xA0打头，范围第1~94列  
  
        byte[] bArr = new byte[2];  
        bArr[0] = (new Integer(highPos)).byteValue();  
        bArr[1] = (new Integer(lowPos)).byteValue();  
        try {  
            str = new String(bArr, "GB2312");   //区位码组合成汉字  
        } catch (UnsupportedEncodingException e) {  
            e.printStackTrace();  
        }  
            return str;  
    } 
}
